# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# * 6 -> [2,3]
# * 144 -> [2,3

num = int(input("Введите число: "))
i = 2 
list = []
inputnumber = num
while i <= num:
    if num % i == 0:
        list.append(i)
        num //= i
        i = 2
    else:
        i += 1
print(f"У {inputnumber} простые множители: {list}")